白话TCPIP协议.html
<?xml version="1.0" encoding="gbk"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>《白话TCP/IP协议》</title>
<meta http-equiv="Content-Type" content="text/html;charset=gbk"/>
<meta name="title" content="《白话TCP/IP协议》"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-09-16 20:50:42 中国标准时间"/>
<meta name="author" content="wyj"/>
<meta name="description" content=""/>
<meta name="keywords" content="emacs, notes"/>

<link rel="stylesheet" type="text/css" href="./style/style.css" />


</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">《白话TCP/IP协议》</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 参考网址：http://www.2cto.com/net/201112/114208.html</a></li>
<li><a href="#sec-2">2 三次握手</a>
<ul>
<li><a href="#sec-2-1">2.1 第一次握手：建立连接时，客户端A发送SYN包(SYN=j)到服务器B，并进入SYN_SEND状态，等待服务器B确认</a></li>
<li><a href="#sec-2-2">2.2 第二次握手：服务器B收到SYN包，必须确认客户A的SYN(ACK=j+1)，同时自己也发送一个SYN包(SYN=k)，即SYN+ACK包，此时服务器进入SYN_RECV状态</a></li>
<li><a href="#sec-2-3">2.3 第三次握手：客户端A收到服务器B的SYN+ACK包，向服务器B发送确认包ACK(ACK=k+1)，此包发送完毕，客户端A和服务器B进入ESTABLISHED状态，完成三次握手</a></li>
</ul>
</li>
<li><a href="#sec-3">3 四次分手</a>
<ul>
<li><a href="#sec-3-1">3.1 客户端A发送一个FIN，用来关闭客户A到服务器B的数据传送</a></li>
<li><a href="#sec-3-2">3.2 服务器B收到这个FIN，它发回一个ACK，确认序号为收到的序号加1。和SYN一样，一个FIN将占用一个序号</a></li>
<li><a href="#sec-3-3">3.3 服务器B关闭与客户端A的连接，发送一个FIN给客户端A</a></li>
<li><a href="#sec-3-4">3.4 客户端A发回ACK报文确认，并将确认序号设置为收到序号加1</a></li>
</ul>
</li>
<li><a href="#sec-4">4 为什么建立连接协议是三次握手，而关闭连接却是四次握手呢？</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 参考网址：<a href="http://www.2cto.com/net/201112/114208.html">http://www.2cto.com/net/201112/114208.html</a></h2>
<div class="outline-text-2" id="text-1">

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 三次握手</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 第一次握手：建立连接时，客户端A发送SYN包(SYN=j)到服务器B，并进入SYN_SEND状态，等待服务器B确认</h3>
<div class="outline-text-3" id="text-2-1">

<p>   A想B请求连接
</p></div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 第二次握手：服务器B收到SYN包，必须确认客户A的SYN(ACK=j+1)，同时自己也发送一个SYN包(SYN=k)，即SYN+ACK包，此时服务器进入SYN_RECV状态</h3>
<div class="outline-text-3" id="text-2-2">

<p>   B回应A：好的，你来吧
</p></div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> 第三次握手：客户端A收到服务器B的SYN+ACK包，向服务器B发送确认包ACK(ACK=k+1)，此包发送完毕，客户端A和服务器B进入ESTABLISHED状态，完成三次握手</h3>
<div class="outline-text-3" id="text-2-3">

<p>   A回应B：好的，我来也
</p></div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 四次分手</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 客户端A发送一个FIN，用来关闭客户A到服务器B的数据传送</h3>
<div class="outline-text-3" id="text-3-1">

<p>   A对B说：我传完了
</p></div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> 服务器B收到这个FIN，它发回一个ACK，确认序号为收到的序号加1。和SYN一样，一个FIN将占用一个序号</h3>
<div class="outline-text-3" id="text-3-2">

<p>   B回应A：好的
</p></div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> 服务器B关闭与客户端A的连接，发送一个FIN给客户端A</h3>
<div class="outline-text-3" id="text-3-3">

<p>   B对A说：我传完了too
</p></div>

</div>

<div id="outline-container-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> 客户端A发回ACK报文确认，并将确认序号设置为收到序号加1</h3>
<div class="outline-text-3" id="text-3-4">

<p>   A回应B：好的，我走了
</p></div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 为什么建立连接协议是三次握手，而关闭连接却是四次握手呢？</h2>
<div class="outline-text-2" id="text-4">


<p class="verse">
这是因为服务端的LISTEN状态下的SOCKET当收到SYN报文的连接请求后，它可以把ACK和SYN(ACK起应答作用，而SYN起同步作用)放在一个报文里来发送。<br/>
但关闭连接时，当收到双方的FIN报文通知时，它仅仅表示对方没有数据发送给你了；<br/>
<b>但未必你所有的数据都全部发送给对方了</b> ，所以你可能未必会马上关闭SOCKET，<br/>
也即你可能还需要发送一些数据给对方之后，再发送FIN报文给对方来表示你同意现在可以关闭连接了，所以它这里的ACK报文和FIN报文多数情况下都是分开发送的<br/>
</p>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-09-16 20:50:42 中国标准时间</p>
<p class="author">Author: wyj</p>
<p class="creator">Org version 7.8.11 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
